{
  "_meta": {
    "note": "Deep lore for Dice Dungeon world. Never stated directly - only hinted through flavor text, items, and environmental details."
  },
  
  "world_concept": {
    "the_probability_engine": "An ancient mechanism beneath reality that calculated fate itself using crystallized chance",
    "the_fall": "When the Engine's keepers vanished, its dice scattered into reality, granting mortals power over probability",
    "the_dungeon": "Not built by hands - the floors are failed probability calculations, crystallized timelines that never came to pass",
    "the_descent": "Each floor deeper shows older, stranger attempts at reality. Floor 100 is where probability itself was born",
    "dice_magic": "Dice are fragments of the Engine. Rolling them doesn't decide fate - it calculates which fate is already happening",
    "the_keepers": "They called themselves the Calculators. Some say they became their equations. Others say they're still here, watching"
  },
  
  "starting_area": {
    "name": "The Threshold Chamber",
    "description": "A circular stone chamber with impossibly smooth walls. Ancient symbols glow faintly on every surface. The air hums with potential.",
    "lore_hints": [
      "The walls show equations in languages that predate writing",
      "Torch flames here burn in perfect geometric patterns",
      "Your footsteps echo strangely, multiplying in number",
      "The door ahead is marked with a single glowing die"
    ],
    
    "signs": [
      {
        "title": "Stone Tablet - The First Law",
        "text": "WHAT WAS ROLLED CANNOT BE UNROLLED\n\nSome say the Calculators wrote this. Others say it wrote them. The distinction may not matter.\n\n[Worn inscription below:] '...many faces, infinite outcomes... Engine demands tribute... deeper = older = truer...'"
      },
      {
        "title": "Crumbling Scroll - Fragment",
        "text": "Day ??? of the Descent:\n\nWe found it. The calculation that made everything. It's still running.\n\nIt wants us to check its work.\n\nThe dice aren't tools. They're QUESTIONS.\n\n[The rest is too damaged to read]"
      },
      {
        "title": "Warning Plaque",
        "text": "DELVERS' NOTICE\n\nThe dungeon rearranges. Always has. Each floor is a different answer to the same question.\n\nQ: What could have been?\nA: Keep rolling.\n\nWe think the original Calculators made it to Floor 87. Their last notes spoke of 'probability collapsing into truth' and 'meeting our own equations.'\n\nNobody's seen them since.\n\n- Delvers' Guild, Year of the Eclipse"
      },
      {
        "title": "Brass Plaque - Rules",
        "text": "THE DUNGEON'S TERMS:\n\n• Each floor is one iteration deeper\n• Dice determine what is, not what might be\n• What you find was always going to be found\n• The stairs only appear when probability allows\n• Items are echoes of decisions never made\n\nYou cannot die here.\nYou can only stop calculating.\n\n[Below in smaller text:]\n'If you see yourself, don't roll. Just run.'"
      }
    ],
    
    "starter_chests": [
      {
        "id": 1,
        "description": "A small wooden chest with geometric carvings. It's warm to the touch.",
        "items": ["Healing Poultice", "Lucky Chip"],
        "gold": 15,
        "lore": "Someone left this for you. Or maybe you left it for yourself on another timeline."
      },
      {
        "id": 2,
        "description": "A stone coffer sealed with wax. The wax shows strange handprints.",
        "items": ["Healing Poultice", "Hourglass Shard"],
        "gold": 15,
        "lore": "The Calculators left marks wherever they went. Some say their hands had too many fingers. Others say too few."
      }
    ],
    
    "ambient_details": [
      "The walls pulse very slightly, like a heartbeat, but the rhythm is mathematical",
      "Shadows here don't quite match the light sources",
      "If you stare at the floor patterns long enough, you swear they're... counting",
      "Something ticks. Not regularly. It ticks in prime numbers."
    ]
  },
  
  "flavor_text_database": {
    "dice_quotes": [
      "The die remembers every roll it never made",
      "The dice are older than they look",
      "Your dice feel heavier after you roll them, as if weighted by outcomes",
      "The dice click together and for a moment you hear... whispering?",
      "Sometimes the dice land before you finish throwing them"
    ],
    "floor_transition": [
      "The stairs descend into deeper probability",
      "Reality feels thinner here. Malleable.",
      "You descend another layer into what-never-was",
      "The Engine's pulse grows louder as you descend",
      "This floor smells of dust and unfinished calculations"
    ],
    "item_implications": [
      "Items here aren't created. They're remembered into existence.",
      "Every item has a story. Most of those stories haven't happened yet.",
      "The hourglass shards - remnants of when time was still being decided",
      "Lucky Chips: probability crystallized into solid form"
    ]
  }
}

